perf_output/after/memcached-1.4.30/32/memcached-1.4.30_workloada_32_after_load.txt
[WARN]  Running against a source checkout. In order to get our runtime dependencies we'll have to invoke Maven. Depending on the state of your system, this may take ~30-45 seconds
[DEBUG]  Running 'mvn -pl site.ycsb:memcached-binding -am package -DskipTests dependency:build-classpath -DincludeScope=compile -Dmdep.outputFilterFile=true'
WARNING: An illegal reflective access operation has occurred
WARNING: Illegal reflective access by com.google.inject.internal.cglib.core.$ReflectUtils$1 (file:/usr/share/maven/lib/guice.jar) to method java.lang.ClassLoader.defineClass(java.lang.String,byte[],int,int,java.security.ProtectionDomain)
WARNING: Please consider reporting this to the maintainers of com.google.inject.internal.cglib.core.$ReflectUtils$1
WARNING: Use --illegal-access=warn to enable warnings of further illegal reflective access operations
WARNING: All illegal access operations will be denied in a future release
java -cp /proj/proxyweb-PG0/adona/YCSB/memcached/conf:/proj/proxyweb-PG0/adona/YCSB/memcached/target/memcached-binding-0.18.0-SNAPSHOT.jar:/root/.m2/repository/org/apache/htrace/htrace-core4/4.1.0-incubating/htrace-core4-4.1.0-incubating.jar:/root/.m2/repository/org/hdrhistogram/HdrHistogram/2.1.4/HdrHistogram-2.1.4.jar:/root/.m2/repository/log4j/log4j/1.2.17/log4j-1.2.17.jar:/root/.m2/repository/org/codehaus/jackson/jackson-mapper-asl/1.9.13/jackson-mapper-asl-1.9.13.jar:/root/.m2/repository/net/spy/spymemcached/2.11.4/spymemcached-2.11.4.jar:/root/.m2/repository/org/codehaus/jackson/jackson-core-asl/1.9.4/jackson-core-asl-1.9.4.jar:/proj/proxyweb-PG0/adona/YCSB/core/target/core-0.18.0-SNAPSHOT.jar site.ycsb.Client -db site.ycsb.db.MemcachedClient -threads 32 -s -P workloads/workloada -p memcached.hosts=localhost:11211 -load
Command line: -db site.ycsb.db.MemcachedClient -threads 32 -s -P workloads/workloada -p memcached.hosts=localhost:11211 -load
YCSB Client 0.18.0-SNAPSHOT

Loading workload...
log4j:WARN No appenders could be found for logger (org.apache.htrace.core.Tracer).
log4j:WARN Please initialize the log4j system properly.
log4j:WARN See http://logging.apache.org/log4j/1.2/faq.html#noconfig for more info.
Starting test.
2021-08-11 16:52:38:528 0 sec: 0 operations; est completion in 0 second 
2021-08-11 16:52:38.691 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 16:52:38.692 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 16:52:38.692 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 16:52:38.691 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 16:52:38.692 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 16:52:38.694 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 16:52:38.695 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2021-08-11 16:52:38.696 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 16:52:38.697 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 16:52:38.697 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 16:52:38.698 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 16:52:38.699 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 16:52:38.700 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 16:52:38.700 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 16:52:38.701 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 16:52:38.701 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 16:52:38.702 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 16:52:38.702 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 16:52:38.703 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 16:52:38.703 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 16:52:38.704 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 16:52:38.705 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 16:52:38.705 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 16:52:38.707 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 16:52:38.707 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 16:52:38.708 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 16:52:38.708 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 16:52:38.709 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 16:52:38.709 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 16:52:38.710 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 16:52:38.710 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 16:52:38.711 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 16:52:38.980 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 16:52:38.985 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 16:52:38.985 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 16:52:38.987 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 16:52:38.986 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 16:52:38.989 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 16:52:38.988 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 16:52:38.991 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 16:52:38.991 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 16:52:38.992 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 16:52:38.993 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 16:52:38.994 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 16:52:38.995 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 16:52:38.996 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 16:52:38.997 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 16:52:38.997 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 16:52:38.998 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 16:52:38.998 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 16:52:38.999 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 16:52:38.999 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 16:52:39.000 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 16:52:39.001 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 16:52:39.001 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 16:52:39.002 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 16:52:39.002 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 16:52:39.003 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 16:52:39.003 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 16:52:39.003 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 16:52:39.004 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 16:52:39.006 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 16:52:39.006 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 16:52:39.007 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 16:52:39:008 0 sec: 1000 operations; 2083.33 current ops/sec; [CLEANUP: Count=32, Max=27343, Min=1878, Avg=18604.66, 90=25887, 99=27343, 99.9=27343, 99.99=27343] [INSERT: Count=1000, Max=152319, Min=445, Avg=7747.44, 90=7083, 99=149503, 99.9=152319, 99.99=152319] 
[OVERALL], RunTime(ms), 480
[OVERALL], Throughput(ops/sec), 2083.3333333333335
[TOTAL_GCS_G1_Young_Generation], Count, 2
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 17
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 3.5416666666666665
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 2
[TOTAL_GC_TIME], Time(ms), 17
[TOTAL_GC_TIME_%], Time(%), 3.5416666666666665
[CLEANUP], Operations, 32
[CLEANUP], AverageLatency(us), 18604.65625
[CLEANUP], MinLatency(us), 1878
[CLEANUP], MaxLatency(us), 27343
[CLEANUP], 95thPercentileLatency(us), 26719
[CLEANUP], 99thPercentileLatency(us), 27343
[INSERT], Operations, 1000
[INSERT], AverageLatency(us), 7747.435
[INSERT], MinLatency(us), 445
[INSERT], MaxLatency(us), 152319
[INSERT], 95thPercentileLatency(us), 14671
[INSERT], 99thPercentileLatency(us), 149503
[INSERT], Return=OK, 1000

 Performance counter stats for 'system wide':

      138544496863      cycles                                                        (66.66%)
       27258228945      branches                                                      (66.69%)
        1005591098      branch-misses             #    3.69% of all branches          (66.68%)
       27098545300      branch-loads                                                  (66.68%)
        1007481395      branch-load-misses                                            (66.67%)
        1045180334      L1-icache-load-misses                                         (66.65%)

      12.801662286 seconds time elapsed